AAC2.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:com="com.gilat.ngnms.server.services.ws.cfg.face" xmlns:urn="urn:com.gilat.ngnms.server.ws.dto.cfg">
   <soap:Header/>
   <soap:Body>
      <com:createApplicationClassification>
         <!--Optional:-->
         <applicationClassification>
            <!--Optional:-->
            <name>?</name>
            <!--Optional:-->
            <description>?</description>
            <!--Optional:-->
            <parentFolder>
               <!--Optional:-->
               <parentType>?</parentType>
               <!--Optional:-->
               <parentFolderId>?</parentFolderId>
            </parentFolder>
            <!--Optional:-->
            <rfc2833DefaultValue>?</rfc2833DefaultValue>
            <!--Optional:-->
            <rfc2833SamplingRate>?</rfc2833SamplingRate>
            <!--Optional:-->
            <ibInviteDefaultCodec>?</ibInviteDefaultCodec>
            <!--Optional:-->
            <sipSessionTimeout>?</sipSessionTimeout>
            <!--Optional:-->
            <obInviteDefaultCodec>?</obInviteDefaultCodec>
            <!--Optional:-->
            <sipTrafficTimer>?</sipTrafficTimer>
            <!--Optional:-->
            <datagramsDropAlgorithm>?</datagramsDropAlgorithm>
            <!--Optional:-->
            <defaultTrafficClass>?</defaultTrafficClass>
            <!--Optional:-->
            <sipSignalingClass>?</sipSignalingClass>
            <!--Optional:-->
            <fwdHTTPAccelerationPriority>?</fwdHTTPAccelerationPriority>
            <!--Optional:-->
            <efFlowPriority>?</efFlowPriority>
            <!--Optional:-->
            <fwdLinkIPv4ApplicationClassificationTable>
               <!--Zero or more repetitions:-->
               <urn:FwdLinkIPv4ApplicationClassification>
                  <!--Optional:-->
                  <startDestinationIpAddress>?</startDestinationIpAddress>
                  <!--Optional:-->
                  <stopDestinationIpAddress>?</stopDestinationIpAddress>
                  <!--Optional:-->
                  <startDestinationPort>?</startDestinationPort>
                  <!--Optional:-->
                  <stopDestinationPort>?</stopDestinationPort>
                  <!--Optional:-->
                  <startSourceIpAddress>?</startSourceIpAddress>
                  <!--Optional:-->
                  <stopSourceIpAddress>?</stopSourceIpAddress>
                  <!--Optional:-->
                  <startSourcePort>?</startSourcePort>
                  <!--Optional:-->
                  <stopSourcePort>?</stopSourcePort>
                  <!--Optional:-->
                  <vlanId>?</vlanId>
                  <!--Optional:-->
                  <operation>?</operation>
                  <!--Optional:-->
                  <protocol>?</protocol>
                  <!--Optional:-->
                  <tosMode>?</tosMode>
                  <!--Optional:-->
                  <tosValue>?</tosValue>
               </urn:FwdLinkIPv4ApplicationClassification>
            </fwdLinkIPv4ApplicationClassificationTable>
            <!--Optional:-->
            <fwdLinkIPv6ApplicationClassificationTable>
               <!--Zero or more repetitions:-->
               <urn:FwdLinkIPv6ApplicationClassification>
                  <!--Optional:-->
                  <startDestinationIPv6Address>?</startDestinationIPv6Address>
                  <!--Optional:-->
                  <stopDestinationIPv6Address>?</stopDestinationIPv6Address>
                  <!--Optional:-->
                  <startDestinationPort>?</startDestinationPort>
                  <!--Optional:-->
                  <stopDestinationPort>?</stopDestinationPort>
                  <!--Optional:-->
                  <startSourceIPv6Address>?</startSourceIPv6Address>
                  <!--Optional:-->
                  <stopSourceIPv6Address>?</stopSourceIPv6Address>
                  <!--Optional:-->
                  <startSourcePort>?</startSourcePort>
                  <!--Optional:-->
                  <stopSourcePort>?</stopSourcePort>
                  <!--Optional:-->
                  <vlanId>?</vlanId>
                  <!--Optional:-->
                  <operation>?</operation>
                  <!--Optional:-->
                  <protocol>?</protocol>
                  <!--Optional:-->
                  <dscp>?</dscp>
               </urn:FwdLinkIPv6ApplicationClassification>
            </fwdLinkIPv6ApplicationClassificationTable>
            <!--Optional:-->
            <multimediaStreamTable>
               <!--Zero or more repetitions:-->
               <urn:MultimediaStream>
                  <!--Optional:-->
                  <codecType>?</codecType>
                  <!--Optional:-->
                  <otherCodecNumber>?</otherCodecNumber>
                  <!--Optional:-->
                  <frameDuration>?</frameDuration>
                  <!--Optional:-->
                  <frameSize>?</frameSize>
                  <!--Optional:-->
                  <pTime>?</pTime>
                  <!--Optional:-->
                  <connectionDelay>?</connectionDelay>
                  <!--Optional:-->
                  <compressionType>?</compressionType>
                  <!--Optional:-->
                  <manipulateSATpTime>?</manipulateSATpTime>
                  <!--Optional:-->
                  <manipulateLANpTime>?</manipulateLANpTime>
                  <!--Optional:-->
                  <maxDelayForOBPack>?</maxDelayForOBPack>
                  <!--Optional:-->
                  <maxNumberofPacksInOB>?</maxNumberofPacksInOB>
                  <!--Optional:-->
                  <samplingRate>?</samplingRate>
               </urn:MultimediaStream>
            </multimediaStreamTable>
            <!--Optional:-->
            <cs1cs7TrafficClassDescriptorsTable>
               <!--Zero or more repetitions:-->
               <urn:Cs1Cs7TrafficClassDescriptor>
                  <!--Optional:-->
                  <queuingAlgorithm>?</queuingAlgorithm>
                  <!--Optional:-->
                  <weight>?</weight>
                  <!--Optional:-->
                  <maximalBitRate>?</maximalBitRate>
                  <!--Optional:-->
                  <flowPriority>?</flowPriority>
               </urn:Cs1Cs7TrafficClassDescriptor>
            </cs1cs7TrafficClassDescriptorsTable>
            <!--Optional:-->
            <af1af4TrafficClassDescriptorsTable>
               <!--Zero or more repetitions:-->
               <urn:Af1Af4TrafficClassDescriptor>
                  <!--Optional:-->
                  <weight>?</weight>
                  <!--Optional:-->
                  <flowPriority>?</flowPriority>
               </urn:Af1Af4TrafficClassDescriptor>
            </af1af4TrafficClassDescriptorsTable>
            <!--Optional:-->
            <fwdHighPriorityWeight>?</fwdHighPriorityWeight>
            <!--Optional:-->
            <fwdMediumPriorityWeight>?</fwdMediumPriorityWeight>
            <!--Optional:-->
            <fwdLowPriorityWeight>?</fwdLowPriorityWeight>
         </applicationClassification>
      </com:createApplicationClassification>
   </soap:Body>
</soap:Envelope>
